0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{   
    
     
    inlet1
    {
       type            flowRateInletVelocity;
       flowRate        constant 1.75e-9;
       value           uniform (0 0 0);
    }

    inlet2
    {
       type            flowRateInletVelocity;
       flowRate        constant 1.75e-9;
       value           uniform (0 0 0);
    }

    inlet3  
    {
       type            flowRateInletVelocity;
       flowRate        constant 1.75e-9;
       value           uniform (0 0 0);
    }

    walls
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
    
   
    outlet
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
