0/alpha1.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet1
    {
       type fixedValue;
       value uniform 1; 
    }

    inlet2
    {
       type fixedValue;
       value uniform 1;
    }

    inlet3
    {
       type fixedValue;
       value uniform 0;
    }
    
    outlet
    {
        type  zeroGradient;
    }
    
    walls
    {
        type constantAlphaContactAngle;
        theta0 50;
        limit gradient;
        value uniform 0;
    }
    
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
