constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
             Diagram of the Geometry for numbering 
 
                                     Inlet 2
                                  
                                      8___9 
	    			      |   |
           			      |   |
				      |   |
 				      |   |
                                      |   |        
          3__________________________2|   |7_________6
   	  |					     |
 Outlet 1 |					     |  Inlet 1
          |___________________________     __________|
          0                          1|   |4         5
                                      |   |            
                                      |   |
 	   			      |   |
                                      |   |
                                      |___|
                                     10   11
				   
                                     Inlet 3	

*/          


convertToMeters 0.001;

vertices        
(
    (0 0 0) 		//0
    (3 0 0) 		//1
    (3 0.2 0) 		//2
    (0 0.2 0) 		//3
    (3.3 0 0) 		//4
    (3.8 0 0) 		//5
    (3.8 0.2 0) 	//6
    (3.3 0.2 0) 	//7
    (3 0.7 0) 		//8
    (3.3 0.7 0) 	//9
    (3.0 -0.5 0)	//10
    (3.3 -0.5 0)	//11

    // shifting along Z direction    

    (0 0 0.25)		//12
    (3 0 0.25) 	       	//13
    (3 0.2 0.25)        //14
    (0 0.2 0.25)  	//15
    (3.3 0 0.25)	//16
    (3.8 0 0.25) 	//17
    (3.8 0.2 0.25) 	//18
    (3.3 0.2 0.25) 	//19
    (3 0.7 0.25) 	//20
    (3.3 0.7 0.25) 	//21    
    (3.0 -0.5 0.25)     //22
    (3.3 -0.5 0.25)     //23
        
);

blocks          
(
    hex (0 1 2 3 12 13 14 15) (120 16 16) simpleGrading (1 1 1)
    hex (1 4 7 2 13 16 19 14) (12 16 16) simpleGrading (1 1 1)
    hex (4 5 6 7 16 17 18 19) (20 16 16) simpleGrading (1 1 1)
    hex (2 7 9 8 14 19 21 20) (12 20 16) simpleGrading (1 1 1)
    hex (10 11 4 1 22 23 16 13) (12 20 16) simpleGrading (1 1 1)   
);

edges           
(
);
boundary
(
    inlet3
    {
        type patch;
        faces
        (
            (6 18 17 5)
        );
    }

    inlet1
    {
        type patch;
        faces
        (
            (8 20 21 9)
        );
    }

    inlet2
    {
        type patch;
        faces
        (
            (11 23 22 10)
        );
    }


    outlet 
    {
        type patch;
        faces
        (
            (0 12 15 3)
        );
    }
  
    walls
    {
        type wall;
        faces
        (
             // Top Walls //
	
            (12 13 14 15)
            (13 16 19 14)
            (16 17 18 19)
            (14 19 21 20)
            (22 23 16 13)          
            
            // Side Walls //

            (1 13 12 0)
            (10 22 13 1)
            (4 16 23 11)
            (5 17 16 4)
            (7 19 18 6)
            (9 21 19 7)
            (2 14 20 8)
            (3 15 14 2)   

             // Bottom Walls //		

            (0 1 2 3)
            (1 4 7 2)
            (4 5 6 7)
            (2 7 9 8)
            (10 11 4 1)
        );
    }
   
    
);

mergePatchPairs
(
);

// ************************************************************************* //
