constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phase1 
{
   transportModel  Newtonian;
   nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06;
   rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
    
}

phase2 
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 0.89e-06;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1790;
   
}


sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.0135;


// ************************************************************************* //
