system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 0
);

regions
(
    boxToCell
    {
        box (3e-3 0.5e-3 -1) (3.3e-3 0.7e-3 1);
        fieldValues
        (
            volScalarFieldValue alpha1 1
        );
    }            
 
    boxToCell
    { 
        box (3e-3 -0.5e-3 -1) (3.3e-3 -0.3e-3 1);
        fieldValues
        (
            volScalarFieldValue alpha1 1
        );
    }


);


// ************************************************************************* //
